In [2]:
import sqlite3

def sql_i(instruction,data_b="data.db"):
    conn=sqlite3.connect(data_b)#data.db will open or create data base data.db
    cur=conn.cursor()
    cur.execute(instruction)#execute the instuction:"CREATE TABLE IF NOT EXISTS PET (ID INTEGER NOT NULL,ANIMAL TEXT,QUANTITY INTEGER)"
    if "select" in instruction.lower() or "pragma" in instruction.lower():
        rows=cur.fetchall()
        conn.close()
        return(rows)
    else:
        conn.commit()  
        conn.close()

In [3]:
sql_i("CREATE TABLE IF NOT EXISTS PET (ID INTEGER NOT NULL,ANIMAL TEXT,QUANTITY INTEGER)")

In [4]:
sql_i('''
CREATE TABLE IF NOT EXISTS PETSALE (ID INTEGER NOT NULL ,
                                 PET TEXT ,
                                 SALEPRICE REAL ,
                                 PROFIT REAL ,
                                 SALEDATE DATE)
                                 ''')

In [5]:
sql_i('''
INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14')
    ''')

In [6]:
sql_i("INSERT INTO PET VALUES (1,'Cat',3),(2,'Dog',4),(3,'Hamster',2)")

In [7]:
output1=sql_i("SELECT * FROM PET")
print(output1)

[(1, 'Cat', 3), (2, 'Dog', 4), (3, 'Hamster', 2)]

In [8]:
output2=sql_i("SELECT * FROM PETSALE")
print(output2)

[(1, 'Cat', 450.09, 100.47, '2018-05-29'), (2, 'Dog', 666.66, 150.76, '2018-06-01'), (3, 'Parrot', 50.0, 8.9, '2018-06-04'), (4, 'Hamster', 60.6, 12.0, '2018-06-11'), (5, 'Goldfish', 48.48, 3.5, '2018-06-14')]

# create pandas data frame from table pet

In [9]:
import pandas as pd
df=pd.DataFrame(output1)
df

   0        1  2
0  1      Cat  3
1  2      Dog  4
2  3  Hamster  2

In [10]:
columns=sql_i("PRAGMA table_info('PET')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'ANIMAL', 'TEXT', 0, None, 0),
 (2, 'QUANTITY', 'INTEGER', 0, None, 0)]

In [11]:
head=[]
for name in columns:#[(0, 'ID', 'INTEGER', 1, None, 0),(1, 'ANIMAL', 'TEXT', 0, None, 0),(2, 'QUANTITY', 'INTEGER', 0, None, 0)]
    head.append(name[1])
head

['ID', 'ANIMAL', 'QUANTITY']

In [13]:
df=pd.DataFrame(output1,columns=head)
df

   ID   ANIMAL  QUANTITY
0   1      Cat         3
1   2      Dog         4
2   3  Hamster         2

# Task A: ALTER using ADD COLUMN

In [14]:
#Add a new QUANTITY column to the PETSALE table and show the altered table.
sql_i("ALTER TABLE PETSALE ADD COLUMN QUANTITY INTEGER")
petsale=sql_i("SELECT * FROM PETSALE")
petsale

[(1, 'Cat', 450.09, 100.47, '2018-05-29', None),
 (2, 'Dog', 666.66, 150.76, '2018-06-01', None),
 (3, 'Parrot', 50.0, 8.9, '2018-06-04', None),
 (4, 'Hamster', 60.6, 12.0, '2018-06-11', None),
 (5, 'Goldfish', 48.48, 3.5, '2018-06-14', None)]

# how to add columns names  ?

In [18]:
columns=sql_i("PRAGMA table_info('PETSALE')")
columns

[(0, 'ID', 'INTEGER', 1, None, 0),
 (1, 'PET', 'TEXT', 0, None, 0),
 (2, 'SALEPRICE', 'REAL', 0, None, 0),
 (3, 'PROFIT', 'REAL', 0, None, 0),
 (4, 'SALEDATE', 'DATE', 0, None, 0),
 (5, 'QUANTITY', 'INTEGER', 0, None, 0)]

In [19]:
head=[]
for name in columns:
    head.append(name[1])
head

['ID', 'PET', 'SALEPRICE', 'PROFIT', 'SALEDATE', 'QUANTITY']

In [20]:
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID       PET  SALEPRICE  PROFIT    SALEDATE QUANTITY
0   1       Cat     450.09  100.47  2018-05-29     None
1   2       Dog     666.66  150.76  2018-06-01     None
2   3    Parrot      50.00    8.90  2018-06-04     None
3   4   Hamster      60.60   12.00  2018-06-11     None
4   5  Goldfish      48.48    3.50  2018-06-14     None

In [21]:
sql_i("UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1")
sql_i("UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2")
sql_i("UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3")
sql_i("UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4")
sql_i("UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5")

In [22]:
petsale=sql_i("SELECT * FROM PETSALE")
petsale=pd.DataFrame(petsale,columns=head)
petsale

   ID       PET  SALEPRICE  PROFIT    SALEDATE  QUANTITY
0   1       Cat     450.09  100.47  2018-05-29         9
1   2       Dog     666.66  150.76  2018-06-01         3
2   3    Parrot      50.00    8.90  2018-06-04         2
3   4   Hamster      60.60   12.00  2018-06-11         6
4   5  Goldfish      48.48    3.50  2018-06-14        24

# Task B: ALTER using DROP COLUMN

In [18]:
#TO DO:DROP COLUMN PROFIT from table PETSALE and print output table

# Task C: ALTER using RENAME COLUMN

In [19]:
#TO DO:RENAME COLUMN PET TO ANIMAL in table PETSALE and print output table

# Task D: DROP TABLE

In [20]:
#TO DO: DROP TABLE PET and print output